cmsis-svd/cmsis-svd/data/Freescale/MKV46F16.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWMA</name>
      <description>Pulse Width Modulator with nano edge placement</description>
      <prependToName>PWMA_</prependToName>
      <baseAddress>0x40033000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x196</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PWMA_CMP0</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>PWMA_RELOAD0</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>PWMA_CMP1</name>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>PWMA_RELOAD1</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>PWMA_CMP2</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>PWMA_RELOAD2</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>PWMA_CMP3</name>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>PWMA_RELOAD3</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>PWMA_CAP</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>PWMA_RERR</name>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>PWMA_FAULT</name>
        <value>91</value>
      </interrupt>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>SM%sCNT</name>
          <description>Counter Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>Counter Register Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>SM%sINIT</name>
          <description>Initial Count Register</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>INIT</name>
              <description>Initial Count Register Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>SM%sCTRL2</name>
          <description>Control 2 Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_SEL</name>
              <description>Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>The IPBus clock is used as the clock for the local prescaler and counter.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>EXT_CLK is used as the clock for the local prescaler and counter.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Submodule 0&apos;s clock (AUX_CLK) is used as the source clock for the local prescaler and counter. This setting should not be used in submodule 0 as it will force the clock to logic 0.</description>
                  <value>#10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RELOAD_SEL</name>
              <description>Reload Source Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The local RELOAD signal is used to reload registers.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The master RELOAD signal (from submodule 0) is used to reload registers. This setting should not be used in submodule 0 as it will force the RELOAD signal to logic 0.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE_SEL</name>
              <description>This read/write bit determines the source of the FORCE OUTPUT signal for this submodule.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>The local force signal, CTRL2[FORCE], from this submodule is used to force updates.</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>The master force signal from submodule 0 is used to force updates. This setting should not be used in submodule 0 as it will hold the FORCE OUTPUT signal to logic 0.</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>The local reload signal from this submodule is used to force updates without regard to the state of LDOK.</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>The master reload signal from submodule0 is used to force updates if LDOK is set. This setting should not be used in submodule0 as it will hold the FORCE OUTPUT signal to logic 0.</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>The local sync signal from this submodule is used to force updates.</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>The master sync signal from submodule0 is used to force updates. This setting should not be used in submodule0 as it will hold the FORCE OUTPUT signal to logic 0.</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>The external force signal, EXT_FORCE, from outside the PWM module causes updates.</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>The external sync signal, EXT_SYNC, from outside the PWM module causes updates.</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE</name>
              <description>Force Initialization</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FRCEN</name>
              <description>Force Initialization Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Initialization from a FORCE_OUT event is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Initialization from a FORCE_OUT event is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INIT_SEL</name>
              <description>Initialization Control Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Local sync (PWM_X) causes initialization.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Master reload from submodule 0 causes initialization. This setting should not be used in submodule 0 as it will force the INIT signal to logic 0. The submodule counter will only reinitialize when a master reload occurs.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Master sync from submodule 0 causes initialization. This setting should not be used in submodule 0 as it will force the INIT signal to logic 0.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>EXT_SYNC causes initialization.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWMX_INIT</name>
              <description>PWM_X Initial Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM45_INIT</name>
              <description>PWM45 Initial Value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM23_INIT</name>
              <description>PWM23 Initial Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEP</name>
              <description>Independent or Complementary Pair Operation</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PWM_A and PWM_B form a complementary PWM pair.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PWM_A and PWM_B outputs are independent PWMs.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAITEN</name>
              <description>WAIT Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGEN</name>
              <description>Debug Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
