cmsis-svd/cmsis-svd/data/Freescale/MKV46F16.svd
        <register>
          <name>CLIST2</name>
          <description>ADC Channel List Register 2</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7654</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SAMPLE4</name>
              <description>Sample Field 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE5</name>
              <description>Sample Field 5</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE6</name>
              <description>Sample Field 6</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE7</name>
              <description>Sample Field 7</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
